doc: README simplify
